#Область ОбработчикиСобытий
	
Процедура ОбработкаПолученияПредставления(Поля, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Поля.ДействуетНаОсновании) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = СтрШаблон("%1, (дейст. на осн.: %2)",Поля.Наименование, ТРег(Поля.ДействуетНаОсновании));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ДействуетНаОсновании");
	Поля.Добавить("Наименование");
	
КонецПроцедуры

#КонецОбласти