
// ** НачалоДоработки Чернов 04.03.2026
#Область ПрограммныйИнтерфейс

// Определение имени формы для программной вставки реквизита КонтактноеЛицо
// Параметры: 
//  Форма - Форма 
Процедура ДополнитьФорму(Форма) Экспорт
	// новый функционал доработки
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьГруппуСкидкиВГруппаШапкаЛево(Форма); 
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		 ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		 ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		 ДобавитьПолеКонтактноеЛицоПослеПолеДоговор(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		 ДобавитьПолеКонтактноеЛицоПослеПолеДоговор(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	// новый функционал доработки
	Если Форма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		ПолеВводаКонтактноеЛицо = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
		ПолеВводаКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаКонтактноеЛицо.ПутьКДанным = "Объект.НДЗ_КонтактноеЛицо";
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоПослеПолеДоговор(Форма)
	// новый функционал доработки
	Если Форма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		Если Форма.Элементы.Найти("Основание") <> Неопределено Тогда
			СледующийЭлемент = Форма.Элементы.Найти("Основание");
			ПолеВводаКонтактноеЛицо = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, СледующийЭлемент);
		ИначеЕсли Форма.Элементы.Найти("СуммаДокумента") <> Неопределено Тогда
			СледующийЭлемент = Форма.Элементы.Найти("СуммаДокумента");
			ПолеВводаКонтактноеЛицо = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, СледующийЭлемент);
		КонецЕсли;
		ПолеВводаКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода; 
		ПолеВводаКонтактноеЛицо.ПутьКДанным = "Объект.НДЗ_КонтактноеЛицо";
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ДобавитьГруппуСкидкиВГруппаШапкаЛево(Форма)
	// новый функционал доработки
	ГруппаСкидки = Форма.Элементы.Добавить("ГруппаСкидки", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ГруппаСкидки.Вид  = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидки.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСкидки.ОтображатьЗаголовок = Ложь;
	ГруппаСкидки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
	
	ДобавитьПолеСогласованнаяСкидкаВГруппеСкидки(Форма);
	ДобавитьКомандуПересчитатьТаблицуВГруппеСкидки(Форма);
	
КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяСкидкаВГруппеСкидки(Форма)
	// новый функционал доработки
	Если Форма.Элементы.Найти("СогласованнаяСкидка") = Неопределено Тогда
		ПолеВводаСогласованнаяСкидка = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидки);
		ПолеВводаСогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаСогласованнаяСкидка.ПутьКДанным = "Объект.СогласованнаяСкидка";
		ПолеВводаСогласованнаяСкидка.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьКомандуПересчитатьТаблицуВГруппеСкидки(Форма)
	// новый функционал доработки
	НоваяКоманда = Форма.Команды.Добавить("ПересчитатьТаблицу");
	НоваяКоманда.Заголовок = "Пересчитать таблицу";
	НоваяКоманда.Действие = "ПересчитатьТаблицу";
	
	НоваяКнопкаКоманды = Форма.Элементы.Добавить("ПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидки);
	НоваяКнопкаКоманды.ИмяКоманды = "ПересчитатьТаблицу";
	НоваяКнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопкаКоманды.Картинка = БиблиотекаКартинок.Обновить;
	НоваяКнопкаКоманды.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
КонецПроцедуры
#КонецОбласти 
// ** КонецДоработки Чернов
