
// ** НачалоДоработки Чернов 04.03.2026
#Область ПрограммныйИнтерфейс

// Определение имени формы для программной вставки реквизита КонтактноеЛицо
// Параметры: 
//  Форма - Форма 
Процедура ДополнитьФорму(Форма) Экспорт
	// новый функционал доработки
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		 ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		 ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		 ДобавитьПолеКонтактноеЛицоПослеПолеДоговор(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		 ДобавитьПолеКонтактноеЛицоПослеПолеДоговор(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	// новый функционал доработки
	Если Форма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		ПолеВводаКонтактноеЛицо = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
		ПолеВводаКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаКонтактноеЛицо.ПутьКДанным = "Объект.НДЗ_КонтактноеЛицо";
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоПослеПолеДоговор(Форма)
	// новый функционал доработки
	Если Форма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		Если Форма.Элементы.Найти("Основание") <> Неопределено Тогда
			СледующийЭлемент = Форма.Элементы.Найти("Основание");
			ПолеВводаКонтактноеЛицо = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, СледующийЭлемент);
		ИначеЕсли Форма.Элементы.Найти("СуммаДокумента") <> Неопределено Тогда
			СледующийЭлемент = Форма.Элементы.Найти("СуммаДокумента");
			ПолеВводаКонтактноеЛицо = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, СледующийЭлемент);
		КонецЕсли;
		ПолеВводаКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода; 
		ПолеВводаКонтактноеЛицо.ПутьКДанным = "Объект.НДЗ_КонтактноеЛицо";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 
// ** КонецДоработки Чернов
